# coding=utf-8
'''
Created on 2016年6月5日
@author: a1

统计基础：
1. 统计的核心问题，即由样本推断总体
    以样本推断总体概率分布、其他属性
    由样本值推断总体的理论值
    - 今天要谈的就是样本推断值和总体理论值之间的关系
2. 常用统计量：
    样本均值
    未修正的样本方差（未修正除以n，修正的除以n-1）
3. 抽样分布
    正态分布的分位数

统计推断：- 统计估计   - 参数估计    - 点估计
                                - 区间估计
                    - 非参数估计
        - 统计假设检验 - 参数      - 单参数
                                - 多参数
                     - 非参数
4. 点估计：
    总体期望
    总体方差
    
    参数的最大似然估计：
        寻找使实验结果（即样本值）出现的可能性最大的那个参数最为真实参数的估计值。
    - 感觉和贝叶斯的后验概率很像？ 都是以样本，找一个发生最大的概率值？
    - 区别？
        - 似然估计需要假设分布情况； 贝叶斯似乎没有？
        
5. 区间估计：
    我们使用点估计，其估计的效果并没有给出，即估计的精度性与可靠性未给出，这种估计是没有
    多大意义的，这时需要引入区间估计。
    
 6. 


上次课后作业：使用贝叶斯解决猜性别问题




'''

